Tekla Open API Reference for Tekla Structures 2025
DatabaseObject.GetIntegerUserProperties Method (Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetIntegerUserProperties(
	out Dictionary<string, int> values
)
Public Function GetIntegerUserProperties (
	<OutAttribute> ByRef values As Dictionary(Of String, Integer)
) As Boolean
Parameters
values
Type: System.Collections.Generic.Dictionary<String, Int32>
Dictionary of name/value pairs that contain the values of the found user properties with the given names.
Return Value
Type: Boolean
True if the request succeeded (the returned values can still be empty if no UserProperties were found).
See Also
Reference
DatabaseObject Class
GetIntegerUserProperties Overload
Tekla.Structures.Drawing Namespace